MediaBinding.SetMetadataConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:tas="http://www.onvif.org/ver10/advancedsecurity/wsdl"
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <trt:SetMetadataConfiguration>
    <trt:Configuration CompressionType="" GeoLocation="false" ShapePolygon="false" token="">
     <tt:Name></tt:Name>
     <tt:UseCount>0</tt:UseCount>
     <tt:PTZStatus>
      <tt:Status>false</tt:Status>
      <tt:Position>false</tt:Position>
     </tt:PTZStatus>
     <tt:Events>
      <tt:Filter>
      </tt:Filter>
      <tt:SubscriptionPolicy>
      </tt:SubscriptionPolicy>
     </tt:Events>
     <tt:Analytics>false</tt:Analytics>
     <tt:Multicast>
      <tt:Address>
       <tt:Type>IPv4</tt:Type>
       <tt:IPv4Address></tt:IPv4Address>
       <tt:IPv6Address></tt:IPv6Address>
      </tt:Address>
      <tt:Port>0</tt:Port>
      <tt:TTL>0</tt:TTL>
      <tt:AutoStart>false</tt:AutoStart>
     </tt:Multicast>
     <tt:SessionTimeout>PT0S</tt:SessionTimeout>
     <tt:AnalyticsEngineConfiguration>
      <tt:AnalyticsModule Name="" Type="xsd:string">
       <tt:Parameters>
        <tt:SimpleItem Name="" Value="">
        </tt:SimpleItem>
        <tt:ElementItem Name="">
        </tt:ElementItem>
        <tt:Extension>
        </tt:Extension>
       </tt:Parameters>
      </tt:AnalyticsModule>
      <tt:Extension>
      </tt:Extension>
     </tt:AnalyticsEngineConfiguration>
     <tt:Extension>
     </tt:Extension>
    </trt:Configuration>
    <trt:ForcePersistence>false</trt:ForcePersistence>
   </trt:SetMetadataConfiguration>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
